Revit 2027 API
Viewport.GetBoxCenter Method
 Returns the center of the outline of the viewport on the sheet, excluding the viewport label.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetBoxCenter()
Public Function GetBoxCenter As XYZ
public:
XYZ^ GetBoxCenter()
member GetBoxCenter : unit -> XYZ
Return Value
XYZ
 The center of the outline of the viewport on the sheet.
Exceptions
Exception | Condition
InvalidOperationException |  The viewport is not on a sheet.
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace